# coding=utf-8
from gearman import GearmanClient
import json
  
'''
from_col: 列表
col:数据库名
key：唯一标识名
attribute：选取的特征名
如需从多个数据库选取，按如下格式输入
fill_type: 填充类型{'特征名':'填充类型'}
填充类型为三种，指定的某个数值、平均数，中位数
attr_weight：权重{'特征名':'权重'}
权重为不同特征值对聚类结果的影响，可量化的比较
need_transfer：需要转换的时间类型特征名
Parameters：聚类算法参数设置
n_cluster：聚类核心数
max_iter：单次运算最多迭代次数
n_init:运算次数
init：如需要指定初始聚类核心，请按如此格式设置'init':{0:{'attr1':'','attr2':'','attr3':''}
                                                   1:{'attr1':'','attr2':'','attr3':''}
                                                   2:{'attr1':'','attr2':'','attr3':''}}
大小为特征数 * 聚类核心数
precompute_distances:是否预先计算距离矩阵，可加快聚类速度，但会增大内存占用
tol:
n_jobs:聚类任务数
'''
new_client = GearmanClient(['192.168.5.41:4730'])
for i in range(3,100):
    attr = {'from_col':[{'col':'start_time', 'key':'name', 'attribute':['2014-9-27',
                                                                        '2014-9-26',
                                                                        '2014-9-24',
                                                                        '2014-10-9',
                                                                        '2014-9-23',
                                                                        '2014-10-8',
                                                                        '2014-9-22',
                                                                        '2014-9-20',
                                                                        '2014-9-30',
                                                                        '2014-11-30',
                                                                        '2014-10-7',
                                                                        '2014-8-19',
                                                                        '2014-8-18',
                                                                        '2014-8-15',
                                                                        '2014-8-14',
                                                                        '2014-8-16',
                                                                        '2014-8-11',
                                                                        '2014-8-13',
                                                                        '2014-8-12',
                                                                        '2014-9-12',
                                                                        '2014-9-13',
                                                                        '2014-9-10',
                                                                        '2014-9-11',
                                                                        '2014-9-16',
                                                                        '2014-9-17',
                                                                        '2014-9-15',
                                                                        '2014-9-18',
                                                                        '2014-9-19',
                                                                        '2014-9-1',
                                                                        '2014-9-2',
                                                                        '2014-9-3',
                                                                        '2014-9-4',
                                                                        '2014-9-5',
                                                                        '2014-9-6',
                                                                        '2014-9-9',
                                                                        '2014-11-21',
                                                                        '2014-11-20',
                                                                        '2014-9-25',
                                                                        '2014-11-22',
                                                                        '2014-11-25',
                                                                        '2014-11-24',
                                                                        '2014-11-27',
                                                                        '2014-11-26',
                                                                        '2014-11-29',
                                                                        '2014-11-28',
                                                                        '2014-9-29',
                                                                        '2014-9-28',
                                                                        '2014-8-30',
                                                                        '2014-10-28',
                                                                        '2014-10-29',
                                                                        '2014-10-27',
                                                                        '2014-10-24',
                                                                        '2014-10-25',
                                                                        '2014-10-22',
                                                                        '2014-10-23',
                                                                        '2014-10-20',
                                                                        '2014-10-21',
                                                                        '2014-11-14',
                                                                        '2014-11-15',
                                                                        '2014-11-17',
                                                                        '2014-11-10',
                                                                        '2014-11-11',
                                                                        '2014-11-12',
                                                                        '2014-11-13',
                                                                        '2014-11-18',
                                                                        '2014-11-19',
                                                                        '2014-8-25',
                                                                        '2014-8-26',
                                                                        '2014-8-27',
                                                                        '2014-8-20',
                                                                        '2014-8-21',
                                                                        '2014-8-22',
                                                                        '2014-8-23',
                                                                        '2014-8-28',
                                                                        '2014-8-29',
                                                                        '2014-10-31',
                                                                        '2014-10-30',
                                                                        '2014-11-2',
                                                                        '2014-11-3',
                                                                        '2014-11-1',
                                                                        '2014-11-6',
                                                                        '2014-11-7',
                                                                        '2014-11-4',
                                                                        '2014-11-5',
                                                                        '2014-11-8',
                                                                        '2014-12-1',
                                                                        '2014-8-5',
                                                                        '2014-8-4',
                                                                        '2014-8-7',
                                                                        '2014-8-6',
                                                                        '2014-8-1',
                                                                        '2014-8-2',
                                                                        '2014-8-9',
                                                                        '2014-8-8',
                                                                        '2014-10-17',
                                                                        '2014-10-16',
                                                                        '2014-10-15',
                                                                        '2014-10-14',
                                                                        '2014-10-13',
                                                                        '2014-10-11',
                                                                        '2014-10-10',
                                                                        '2014-10-18']}],
            'fill_type':{},
            'attr_weight':{},
            'needtransfer':[],
            'Parameters':{'n_clusters':i,'max_iter':300,'n_init':10,'init':'k-means++',
                          'precompute_distances':True,'tol':1e-4,'n_jobs':1}}
    a = json.dumps(attr)
    
    current_request = new_client.submit_job('data_cluster', a)
    new_result = current_request.result
    print new_result